#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a1624ea6-ba03-4982-b59d-0f20423d7ed4]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5085baad-9389-4763-b3d0-b81582d7c661]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=82106d8a-a91e-4d60-9704-53b3fb54e214]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=313fa3d3-996f-4ae7-8b59-45eeaca7a5ee]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ff51c39-4330-4c11-90ff-7829fd948015]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2feb5617-2be9-483d-8ec0-04ecc6deff3f]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=fa150b72-fdfc-4126-b025-04e9d0965993]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b769b4af-d555-4b44-aa17-99e776c10353]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=747dd4c8-c0a7-48cd-bcd4-d41e6f80e63e]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7c9737d5-668f-401b-a9d9-92bc6ce3aab3]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f8966d6a-b47d-412b-b729-f8354024f4f3]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dbfcfc06-816a-44e9-9729-bbb0dcbd3ac5]
module.keycloak_dev.module.onestopauth.module.client_zz-2443.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=014a20f4-7c12-447e-80d1-52b58aa01bac]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=548d4bc8-baf3-4b7b-a1c2-cd17816963ba]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cf9573a2-c57f-45e0-a3fc-57d8550ef3d2]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=475b8ae4-62e0-4635-aeae-1faeda2a2f89]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=512c1cce-8b3c-4adc-88ba-d18d55398163]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=953cae08-cf43-4838-8f62-01114f55e631]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=aded100c-b585-4576-885e-762c67507c2f]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f685c254-23b3-4c35-a608-0fa5d181b4e9]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=860529bf-45f8-4fcb-a675-3ec25bb300f1]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d880126e-28c8-4c16-912c-e477744a7777]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=736f1be5-f20d-4b6e-b5b1-502a9fddc306]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-110.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=60fb2f48-1710-4f6d-84fa-e3de325969fa]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d0bc0f9e-8327-47ec-bca6-1f1e1baa303d]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=228000d0-3e9f-4d89-bfe6-32768754a956]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2e62bc1f-6ddb-4b80-87e6-2681927bca93]
module.keycloak_dev.module.onestopauth.module.client_https-bcgov-github-io-sso-terraform-dev-requestd-1521.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=abee11b5-692a-4b5f-9873-571fcec4f923]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=13b43351-9b51-421f-9482-5baece73e1b7]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=463abe9a-49c6-4e3f-8912-60ed0cdb6586]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c05e19d7-97f3-4bc6-bb4c-4ad1e55e33c1]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f988d4ed-cba6-497a-9592-14f8181762f6]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=45a58d16-3fa3-453b-9a56-7f023d2e73df]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f3e28fc6-db24-4da6-b1cc-8d5c7626dd33]
module.keycloak_dev.module.onestopauth.module.client_junmin-client-test-101.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=05815902-8e7c-4815-a238-8c0cd3baa1ca]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=77e7e184-f43b-4b75-9a53-07b51f233d13]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e10a6e98-1292-4605-9c6b-ccf3838d712b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1a5a45fe-e20c-4a4e-b7df-e27df4edbb0a]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=38014355-1b16-496d-ad27-43eb8516db81]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6677d385-777e-4c8d-a5ee-594194b6d3de]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2f825593-3ffc-45e3-a0dd-a7d5f61a031c]
module.keycloak_dev.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4ec7c321-b3c7-484d-b25d-b1b5f0b87da5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6c7e0646-6f2a-4eb3-a7f4-31b0c340fe41]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=54ef8733-7d92-4861-856a-a09e62ba595e]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5c0dc433-cdee-409a-a664-454333d15633]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1171f0c5-d99a-433f-8e06-aa9755dcbbea]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0158e912-ee0b-4c71-9e93-f311c88e0e18]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5776640a-5533-45d8-854a-261a866a39f6]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8ff6a0fe-9347-4bf4-813b-6f589390e6c0]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=faf1f28b-4112-4dd2-9a26-c3cbc14a9e4e]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6adff7c6-2b56-4487-81fe-9f971a811395]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=2a8ea77a-cf20-4da2-9409-ab12f7aad71a]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=85265bc8-746c-4278-b1d3-4dfcc44269e3]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=e0ddcb68-4096-42e1-8fd5-2518504141ff]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0a73c6f7-0a33-4775-899a-9d0976d05b83]
module.keycloak_dev.module.onestopauth.module.client_ztest-134.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5462e686-cd42-4b34-9856-162b6d45c728]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=33296c96-6e89-441f-8518-1872653046f3]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cdacfd7f-d4cf-4b28-b5f8-3610d3b347a6]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b6cb32b7-ff38-42d7-a36e-3ca3f0a70fc5]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4ca0e2aa-0c07-4c65-826a-5d4af73568a4]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d6f06ed8-5a10-4b32-ad4e-00c0f21bac44]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c3451018-ecd3-49e0-913f-45cd6a0fc341]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b89a4683-f78b-4f49-b43d-a3fb6de3b557]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=38d3dd6c-7180-480a-8c32-8c48e7dcfadf]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b4043d02-4132-4deb-b0ff-719e959bb797]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c0369e84-01ea-42c2-9c88-c8b1c93a8123]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b8feccbc-035d-4aa1-9699-50ecd51667bf]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1772ede9-79d6-484d-a32b-8f27a3ff202e]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8b36b590-1b54-48b5-9902-883ea3376b01]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=75087273-e5b5-4ade-b157-70c6ebe829b8]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7f36873e-e532-4665-adfb-e67bef1bdfdd]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=242f559a-5b9f-4351-abda-4aa1cd1ea96f]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b7c4055c-8f66-459f-94e4-cf51b597c772]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5471293-c661-4e0b-a6f7-5520712c4392]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=656ea0c6-04d0-4953-a670-9482828b9b56]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c0d6e389-c17c-4c6d-b1a2-4cf9d6049c6a]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a486276e-2359-42aa-b7f5-624e9bbdaaac]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1a95fbf4-d7e6-4510-85ea-1eddf4f7763b]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=341d12dd-9534-42eb-9f1b-e97ab0283cf4]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=4f1c1da5-e690-46f5-996c-ed13c15a4a52]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=afc2c666-9e52-474e-89a6-1999728688e6]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5cd65f11-28ca-4761-9372-aa0514719b43]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ede2ef2f-0db7-4163-91d9-893300e3a68a]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b1fb3a12-bd49-4b35-90ff-3894904dd0f8]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-09-2021-334.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cef6c1e2-d907-4fa7-8168-81c7930f3eb2]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=296675df-c53f-4a4f-ae61-15b1c75e6121]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=74956dc4-e394-4d03-b95a-94bac1859151]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b021dd34-f5ef-47b2-8e6f-ed1b7b0a9546]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=644454a0-18ee-4337-b136-f77c0d0f2077]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d2238682-f4ce-4363-8908-0bb99903871e]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ceab70d-9bfc-429a-9f3a-ad176d13f244]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=54e833a1-2a14-44fa-8d95-0bf7670cfeef]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=13767fcf-97d9-4c05-b5c9-787426ec024f]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=14ff3539-537a-45b8-bbe7-d17bff79b2fd]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=391af413-2e3b-4c5a-b29a-1e2bfdf536cf]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8033fed-3496-4aaf-8af5-c4382e2ca074]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6a19ddf4-b00c-49cd-a5bb-78f610a40849]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6e424a89-3b3f-40a1-bdec-939cc68006aa]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b414a380-c2fc-4953-92dd-9d0cdf5a34e8]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=fbbb1b9f-50f0-4b3a-a20f-f2e000b23792]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=edb8a998-9969-4f44-8c16-77c331c4aadb]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2eec2798-ebef-43da-9215-caf48e5b2f65]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0732f9be-89b3-49ca-ba40-c804c45318db]
module.keycloak_dev.module.onestopauth.module.client_jon-test-12-466.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=cc0263f0-9be5-4905-86af-8d7e8b62c960]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=6bc8993e-01f2-4a2a-9aa8-dafd50675644]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d603ec42-8ab0-4ee8-8bb1-1855a5aa9f4a]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5fd22afb-a6ac-45b7-946a-dd3a7968b10b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=09d4d461-4e62-4e8a-b7de-363bc47dc489]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=54045bf5-9c16-41df-87aa-6cf149ecf5ea]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=61f22a2e-e7ae-47ac-9d43-7246e2557b7c]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=27c1b1b9-40a9-48fc-8769-dc904bc3a145]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9ed2c5ba-b480-49c6-8bac-0fbbe1baed67]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=723cc968-2a88-4e28-b0ac-c277498734c7]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ce834ef1-4278-405c-a8ff-a4567e0a4613]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=29e7cac3-d053-46d4-a1e3-04ca8a794c31]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=60cf3621-874e-4ef2-9637-5c48ce107e20]
module.keycloak_dev.module.onestopauth.module.client_jon-test-3-35.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f5c7f4cd-5758-4053-839a-a3f86eedc207]
module.keycloak_dev.module.onestopauth.module.client_aug-18-748-test-diff-email-696.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=56103357-1c26-4df5-9800-3fd1c5a4e130]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9fa72992-16bb-425d-a6ce-73d88f71931a]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=18ac95f7-15d8-426d-a2f8-74aef2c9833a]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=31ce7dc9-f930-421f-a93e-86a0c0ead613]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=15b25011-e2f9-4624-aa95-ec31762efd41]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=aaec779c-3997-4bd1-9110-053ac3562a1e]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a3dd3dbe-84af-41aa-aa94-15eb4d4d7dbb]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b5b248c8-6436-4bf4-9ccb-6f4c98a9f3f3]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a5ceda21-fbcc-40e0-ab5d-97a08df2305f]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=202223a0-a71a-43df-b86e-d8a0e19603b6]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=dd1e36d8-5e78-4051-a411-74aecb4521a4]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=140e35d9-4536-472a-a440-2abdd0822d11]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=afeb995f-a519-4f19-a10b-cde7e1a40803]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0a3c30d8-a46c-4cee-a25f-fd205b3ab4c4]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=47f1083e-cf1d-4a5a-9298-b56542faec7d]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=735ef5cc-f171-4b01-9154-9a58908f2713]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d00fe817-e89f-43b8-aeaa-4b3379ac0b29]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=841821f9-723c-47bb-a56c-91785f1fade6]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7a9e79da-e1da-4dfd-a7d7-336cdefe91a1]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=89161301-45c5-4d41-860a-7315549335a8]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5c549940-4259-483d-9e8c-58798d94783d]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8d851f77-9abe-499c-b6c1-85c82800140b]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ea249887-de57-4258-b6f4-b70aae7848d8]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=23bf5767-8186-4afc-83c8-c07b3ee1f5f9]
module.keycloak_dev.module.onestopauth.module.client_junmin-request-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c6ffacca-6e07-465c-a0f0-fca71212fb2b]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=35e9a0b2-f32d-4127-a114-e96b6ea2092f]
module.keycloak_dev.module.onestopauth.module.client_jumintestclientclient-36.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d24ad71d-4a12-4c7c-abd0-45d51729bb9e]
module.keycloak_dev.module.onestopauth_both.module.client_test-2774.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d2abfa5d-7227-45c4-9007-6168a20c2236]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=3bbf1856-ce26-4a86-87a2-8e83330980f3]
module.keycloak_dev.module.onestopauth.module.client_aug-31-424-pm-1323.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=01f34eee-1a4d-4f22-92b1-e08852badc69]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-test-2971"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-test-2971"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-test-2971"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-test-2971"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://a",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "bceid-test-2971"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "bceid-test-2971"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_bceid-test-2971.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "bceid-test-2971"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "bceid-test-2971"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://b",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2824 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*